; domain
;; Peg Solitaire domain

(define (domain pegsolitaire-netbenefit)
    (:requirements :typing :goal-utilities)
    (:types location - object)
    (:predicates
        (IN-LINE ?x ?y ?z - location)
        (occupied ?l - location)
        (free ?l - location)
    )

    (:action jump
     :parameters (?from - location ?over - location ?to - location)
     :precondition (and 
                       (IN-LINE ?from ?over ?to)
                       (occupied ?from)
                       (occupied ?over)
                       (free ?to)
                   )
     :effect (and
                 (not (occupied ?from))
                 (not (occupied ?over))
                 (not (free ?to))
                 (free ?from)
                 (free ?over)
                 (occupied ?to)
             )
    )
)

; problem
;; The following problem is taken from the problem library of Solipeg 2.2:
;; 
;; Solipeg, a Classic Marble Puzzle Game for the
;; Psion Series 3a, 3c and Siena
;; Version 2.2 (and 2.2 Lite)
;; Copyright (C) 1993, 1994, 1995, 1996 J Cade Roux
;; 
;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 2 of the License, or
;; (at your option) any later version.
;; 
;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;; 
;; You should have received a copy of the GNU General Public License
;; along with this program; if not, write to the Free Software
;; Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
;; 
;; (see http://ourworld.compuserve.com/homepages/cade/psionsof.htm,
;; http://ourworld.compuserve.com/homepages/cade/solsrc22.zip)
;; 
;; The Solipeg problem library in turn is derived from the booklet
;; "Problems in Puzzle-Peg" included in the game Puzzle-Peg (Third
;; Edition, 1924, Lubbers & Bell Mfg. Co.,Clinton, Iowa, USA).
;; 
;; Original problem number and name: "84 Scatter"
;; 
;; Number of pegs:                  23
;; Number of diagonal moves needed: 0
;; 
;; Problem description:
;; "*" denotes "occupied"
;; "o" denotes "free"
;; 
;;     o * o     
;;     * * *     
;; * * o * o * * 
;; o * * * o * * 
;; * * * * o * * 
;;     o * *     
;;     o * o     
;; 
;; Target position = (3,3)
;; 
(define (problem pegsolitaire-sequential-084)
    (:domain pegsolitaire-netbenefit)
    (:objects
        pos-0-2 - location
        pos-0-3 - location
        pos-0-4 - location
        pos-1-2 - location
        pos-1-3 - location
        pos-1-4 - location
        pos-2-0 - location
        pos-2-1 - location
        pos-2-2 - location
        pos-2-3 - location
        pos-2-4 - location
        pos-2-5 - location
        pos-2-6 - location
        pos-3-0 - location
        pos-3-1 - location
        pos-3-2 - location
        pos-3-3 - location
        pos-3-4 - location
        pos-3-5 - location
        pos-3-6 - location
        pos-4-0 - location
        pos-4-1 - location
        pos-4-2 - location
        pos-4-3 - location
        pos-4-4 - location
        pos-4-5 - location
        pos-4-6 - location
        pos-5-2 - location
        pos-5-3 - location
        pos-5-4 - location
        pos-6-2 - location
        pos-6-3 - location
        pos-6-4 - location
    )
    (:init
        (IN-LINE pos-0-2 pos-0-3 pos-0-4)
        (IN-LINE pos-0-4 pos-0-3 pos-0-2)
        (IN-LINE pos-0-2 pos-1-2 pos-2-2)
        (IN-LINE pos-2-2 pos-1-2 pos-0-2)
        (IN-LINE pos-0-3 pos-1-3 pos-2-3)
        (IN-LINE pos-2-3 pos-1-3 pos-0-3)
        (IN-LINE pos-0-4 pos-1-4 pos-2-4)
        (IN-LINE pos-2-4 pos-1-4 pos-0-4)
        (IN-LINE pos-1-2 pos-1-3 pos-1-4)
        (IN-LINE pos-1-4 pos-1-3 pos-1-2)
        (IN-LINE pos-1-2 pos-2-2 pos-3-2)
        (IN-LINE pos-3-2 pos-2-2 pos-1-2)
        (IN-LINE pos-1-3 pos-2-3 pos-3-3)
        (IN-LINE pos-3-3 pos-2-3 pos-1-3)
        (IN-LINE pos-1-4 pos-2-4 pos-3-4)
        (IN-LINE pos-3-4 pos-2-4 pos-1-4)
        (IN-LINE pos-2-0 pos-2-1 pos-2-2)
        (IN-LINE pos-2-2 pos-2-1 pos-2-0)
        (IN-LINE pos-2-0 pos-3-0 pos-4-0)
        (IN-LINE pos-4-0 pos-3-0 pos-2-0)
        (IN-LINE pos-2-1 pos-2-2 pos-2-3)
        (IN-LINE pos-2-3 pos-2-2 pos-2-1)
        (IN-LINE pos-2-1 pos-3-1 pos-4-1)
        (IN-LINE pos-4-1 pos-3-1 pos-2-1)
        (IN-LINE pos-2-2 pos-2-3 pos-2-4)
        (IN-LINE pos-2-4 pos-2-3 pos-2-2)
        (IN-LINE pos-2-2 pos-3-2 pos-4-2)
        (IN-LINE pos-4-2 pos-3-2 pos-2-2)
        (IN-LINE pos-2-3 pos-2-4 pos-2-5)
        (IN-LINE pos-2-5 pos-2-4 pos-2-3)
        (IN-LINE pos-2-3 pos-3-3 pos-4-3)
        (IN-LINE pos-4-3 pos-3-3 pos-2-3)
        (IN-LINE pos-2-4 pos-2-5 pos-2-6)
        (IN-LINE pos-2-6 pos-2-5 pos-2-4)
        (IN-LINE pos-2-4 pos-3-4 pos-4-4)
        (IN-LINE pos-4-4 pos-3-4 pos-2-4)
        (IN-LINE pos-2-5 pos-3-5 pos-4-5)
        (IN-LINE pos-4-5 pos-3-5 pos-2-5)
        (IN-LINE pos-2-6 pos-3-6 pos-4-6)
        (IN-LINE pos-4-6 pos-3-6 pos-2-6)
        (IN-LINE pos-3-0 pos-3-1 pos-3-2)
        (IN-LINE pos-3-2 pos-3-1 pos-3-0)
        (IN-LINE pos-3-1 pos-3-2 pos-3-3)
        (IN-LINE pos-3-3 pos-3-2 pos-3-1)
        (IN-LINE pos-3-2 pos-3-3 pos-3-4)
        (IN-LINE pos-3-4 pos-3-3 pos-3-2)
        (IN-LINE pos-3-2 pos-4-2 pos-5-2)
        (IN-LINE pos-5-2 pos-4-2 pos-3-2)
        (IN-LINE pos-3-3 pos-3-4 pos-3-5)
        (IN-LINE pos-3-5 pos-3-4 pos-3-3)
        (IN-LINE pos-3-3 pos-4-3 pos-5-3)
        (IN-LINE pos-5-3 pos-4-3 pos-3-3)
        (IN-LINE pos-3-4 pos-3-5 pos-3-6)
        (IN-LINE pos-3-6 pos-3-5 pos-3-4)
        (IN-LINE pos-3-4 pos-4-4 pos-5-4)
        (IN-LINE pos-5-4 pos-4-4 pos-3-4)
        (IN-LINE pos-4-0 pos-4-1 pos-4-2)
        (IN-LINE pos-4-2 pos-4-1 pos-4-0)
        (IN-LINE pos-4-1 pos-4-2 pos-4-3)
        (IN-LINE pos-4-3 pos-4-2 pos-4-1)
        (IN-LINE pos-4-2 pos-4-3 pos-4-4)
        (IN-LINE pos-4-4 pos-4-3 pos-4-2)
        (IN-LINE pos-4-2 pos-5-2 pos-6-2)
        (IN-LINE pos-6-2 pos-5-2 pos-4-2)
        (IN-LINE pos-4-3 pos-4-4 pos-4-5)
        (IN-LINE pos-4-5 pos-4-4 pos-4-3)
        (IN-LINE pos-4-3 pos-5-3 pos-6-3)
        (IN-LINE pos-6-3 pos-5-3 pos-4-3)
        (IN-LINE pos-4-4 pos-4-5 pos-4-6)
        (IN-LINE pos-4-6 pos-4-5 pos-4-4)
        (IN-LINE pos-4-4 pos-5-4 pos-6-4)
        (IN-LINE pos-6-4 pos-5-4 pos-4-4)
        (IN-LINE pos-5-2 pos-5-3 pos-5-4)
        (IN-LINE pos-5-4 pos-5-3 pos-5-2)
        (IN-LINE pos-6-2 pos-6-3 pos-6-4)
        (IN-LINE pos-6-4 pos-6-3 pos-6-2)
        (free pos-0-2)
        (free pos-0-4)
        (free pos-2-2)
        (free pos-2-4)
        (free pos-3-0)
        (free pos-3-4)
        (free pos-4-4)
        (free pos-5-2)
        (free pos-6-2)
        (free pos-6-4)
        (occupied pos-0-3)
        (occupied pos-1-2)
        (occupied pos-1-3)
        (occupied pos-1-4)
        (occupied pos-2-0)
        (occupied pos-2-1)
        (occupied pos-2-3)
        (occupied pos-2-5)
        (occupied pos-2-6)
        (occupied pos-3-1)
        (occupied pos-3-2)
        (occupied pos-3-3)
        (occupied pos-3-5)
        (occupied pos-3-6)
        (occupied pos-4-0)
        (occupied pos-4-1)
        (occupied pos-4-2)
        (occupied pos-4-3)
        (occupied pos-4-5)
        (occupied pos-4-6)
        (occupied pos-5-3)
        (occupied pos-5-4)
        (occupied pos-6-3)
    )
    (:goal (and
        (free pos-0-2)
        (free pos-0-3)
        (free pos-0-4)
        (free pos-1-2)
        (free pos-1-3)
        (free pos-1-4)
        (free pos-2-0)
        (free pos-2-1)
        (free pos-2-2)
        (free pos-2-3)
        (free pos-2-4)
        (free pos-2-5)
        (free pos-2-6)
        (free pos-3-0)
        (free pos-3-1)
        (free pos-3-2)
        (free pos-3-4)
        (free pos-3-5)
        (free pos-3-6)
        (free pos-4-0)
        (free pos-4-1)
        (free pos-4-2)
        (free pos-4-3)
        (free pos-4-4)
        (free pos-4-5)
        (free pos-4-6)
        (free pos-5-2)
        (free pos-5-3)
        (free pos-5-4)
        (free pos-6-2)
        (free pos-6-3)
        (free pos-6-4)
        (occupied pos-3-3)
           )
    )
)

; plan
1. (jump pos-4-2 pos-4-3 pos-4-4)
   deleted: (occupied pos-4-2) (occupied pos-4-3) (free pos-4-4)
   added: (free pos-4-2) (free pos-4-3) (occupied pos-4-4)
   goals met: 12 of 33
2. (jump pos-6-3 pos-5-3 pos-4-3)
   deleted: (occupied pos-6-3) (occupied pos-5-3) (free pos-4-3)
   added: (free pos-6-3) (free pos-5-3) (occupied pos-4-3)
   goals met: 13 of 33
3. (jump pos-2-0 pos-2-1 pos-2-2)
   deleted: (occupied pos-2-0) (occupied pos-2-1) (free pos-2-2)
   added: (free pos-2-0) (free pos-2-1) (occupied pos-2-2)
   goals met: 14 of 33
4. (jump pos-2-2 pos-2-3 pos-2-4)
   deleted: (occupied pos-2-2) (occupied pos-2-3) (free pos-2-4)
   added: (free pos-2-2) (free pos-2-3) (occupied pos-2-4)
   goals met: 15 of 33
5. (jump pos-5-4 pos-4-4 pos-3-4)
   deleted: (occupied pos-5-4) (occupied pos-4-4) (free pos-3-4)
   added: (free pos-5-4) (free pos-4-4) (occupied pos-3-4)
   goals met: 16 of 33
6. (jump pos-2-4 pos-1-4 pos-0-4)
   deleted: (occupied pos-2-4) (occupied pos-1-4) (free pos-0-4)
   added: (free pos-2-4) (free pos-1-4) (occupied pos-0-4)
   goals met: 17 of 33
7. (jump pos-4-0 pos-4-1 pos-4-2)
   deleted: (occupied pos-4-0) (occupied pos-4-1) (free pos-4-2)
   added: (free pos-4-0) (free pos-4-1) (occupied pos-4-2)
   goals met: 18 of 33
8. (jump pos-3-3 pos-4-3 pos-5-3)
   deleted: (occupied pos-3-3) (occupied pos-4-3) (free pos-5-3)
   added: (free pos-3-3) (free pos-4-3) (occupied pos-5-3)
   goals met: 17 of 33
9. (jump pos-3-2 pos-4-2 pos-5-2)
   deleted: (occupied pos-3-2) (occupied pos-4-2) (free pos-5-2)
   added: (free pos-3-2) (free pos-4-2) (occupied pos-5-2)
   goals met: 18 of 33
10. (jump pos-2-6 pos-2-5 pos-2-4)
   deleted: (occupied pos-2-6) (occupied pos-2-5) (free pos-2-4)
   added: (free pos-2-6) (free pos-2-5) (occupied pos-2-4)
   goals met: 19 of 33
11. (jump pos-4-6 pos-4-5 pos-4-4)
   deleted: (occupied pos-4-6) (occupied pos-4-5) (free pos-4-4)
   added: (free pos-4-6) (free pos-4-5) (occupied pos-4-4)
   goals met: 20 of 33
12. (jump pos-5-2 pos-5-3 pos-5-4)
   deleted: (occupied pos-5-2) (occupied pos-5-3) (free pos-5-4)
   added: (free pos-5-2) (free pos-5-3) (occupied pos-5-4)
   goals met: 21 of 33
13. (jump pos-3-4 pos-2-4 pos-1-4)
   deleted: (occupied pos-3-4) (occupied pos-2-4) (free pos-1-4)
   added: (free pos-3-4) (free pos-2-4) (occupied pos-1-4)
   goals met: 22 of 33
14. (jump pos-0-4 pos-1-4 pos-2-4)
   deleted: (occupied pos-0-4) (occupied pos-1-4) (free pos-2-4)
   added: (free pos-0-4) (free pos-1-4) (occupied pos-2-4)
   goals met: 23 of 33
15. (jump pos-0-3 pos-1-3 pos-2-3)
   deleted: (occupied pos-0-3) (occupied pos-1-3) (free pos-2-3)
   added: (free pos-0-3) (free pos-1-3) (occupied pos-2-3)
   goals met: 24 of 33
16. (jump pos-2-4 pos-2-3 pos-2-2)
   deleted: (occupied pos-2-4) (occupied pos-2-3) (free pos-2-2)
   added: (free pos-2-4) (free pos-2-3) (occupied pos-2-2)
   goals met: 25 of 33
17. (jump pos-1-2 pos-2-2 pos-3-2)
   deleted: (occupied pos-1-2) (occupied pos-2-2) (free pos-3-2)
   added: (free pos-1-2) (free pos-2-2) (occupied pos-3-2)
   goals met: 26 of 33
18. (jump pos-3-6 pos-3-5 pos-3-4)
   deleted: (occupied pos-3-6) (occupied pos-3-5) (free pos-3-4)
   added: (free pos-3-6) (free pos-3-5) (occupied pos-3-4)
   goals met: 27 of 33
19. (jump pos-3-1 pos-3-2 pos-3-3)
   deleted: (occupied pos-3-1) (occupied pos-3-2) (free pos-3-3)
   added: (free pos-3-1) (free pos-3-2) (occupied pos-3-3)
   goals met: 30 of 33
20. (jump pos-3-3 pos-3-4 pos-3-5)
   deleted: (occupied pos-3-3) (occupied pos-3-4) (free pos-3-5)
   added: (free pos-3-3) (free pos-3-4) (occupied pos-3-5)
   goals met: 29 of 33
21. (jump pos-5-4 pos-4-4 pos-3-4)
   deleted: (occupied pos-5-4) (occupied pos-4-4) (free pos-3-4)
   added: (free pos-5-4) (free pos-4-4) (occupied pos-3-4)
   goals met: 30 of 33
22. (jump pos-3-5 pos-3-4 pos-3-3)
   deleted: (occupied pos-3-5) (occupied pos-3-4) (free pos-3-3)
   added: (free pos-3-5) (free pos-3-4) (occupied pos-3-3)
   goals met: 33 of 33
